In [15]:
import pandas as pd
import numpy as np

In [16]:
pd.DataFrame(np.vstack([list('ABCDE'),
np.round(np.random.rand(3, 5), 2)]).T,
columns=["C1", "C2", "C3", "C4"])

  C1    C2    C3    C4
0  A   0.6   0.3  0.07
1  B  0.66   0.5  0.27
2  C  0.45  0.39  0.49
3  D  0.43  0.33  0.26
4  E  0.97  0.94  0.45

In [18]:
dd = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호','금액'])
dd

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [30]:
dd.groupby(dd['금액']).sum()

        고객번호
금액
5000    1006
10000   1001
15000   1005
20000   1001
30000   1001
100000  1008

In [33]:
dd.groupby(dd['고객번호']).sum()

          금액
고객번호
1001   60000
1005   15000
1006    5000
1008  100000

In [32]:
호

NameError: name '호' is not defined